# -*- coding: utf-8 -*-
"""Untitled0.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1ybSE4sFPPaIkrOI3xblwoY6OQatGFKIu

Задача 2: Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) |
"""

# если не проводить проверку на "значность" числа, то
number_ = input("Введите число:\n")
sum_ = 0
for i in range(len(number_)):
  sum_ += int(number_[i])

print(f'Сумма цифр чисела {number_}: {sum_}')

"""Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

*Пример:*

6 -> 1  4  1
24 -> 4  16  4
    60 -> 10  40  10
"""

number = int(input('Введите число:\n'))
if number % 6 != 0:
  print('Задача не имеет решения')
else:
  Serjozha = int(number / 6)
  Petja = Serjozha
  Katja = Petja * 4
  print(f'{Petja = } , {Katja = }, {Serjozha = }')

"""Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

*Пример:*

385916 -> yes
123456 -> no
"""

number = input('Enter 6 numbers ticket: \n')
while len(number) != 6:
  number = input('Enter 6 numbers ticket: \n')
sum_start = 0
sum_end = 0
for i in range(int(len(number)/2)):
  sum_start += int(number[i])
  sum_end += int(number[(i - (2 * i + 1))])

if sum_start == sum_end:
  print(f'{number} - is happy ticket!!!')
else:
  print(f'{number} - NOT happy ticket :(')

"""Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

*Пример:*

3 2 4 -> yes
3 2 1 -> no
"""

print('Введите сколько на сколько долек наша шоколадка.')
n = int(input('Сначала первую сторону: \n'))
m = int(input('Теперь вторую сторону: \n'))
k = int(input('Сколько долек хотите отломить: \n'))
text = ''

if k % 10 == 1:
  text += 'долька'
elif 1 < k % 10 and k % 10 < 5:
  text += 'дольки'
else:
  text += 'долек'


chocolate = n * m
if k > chocolate:
  print(f'Ну, у нас шоколадка поменьше... в ней только {chocolate} {text}.')
elif k % n == 0 or k % m == 0:
  print(f'Возможно отломить {k} {text} от этой шоколадки.')
else:
  print(f'От этой шоколадки НЕвозможно отломить {k} {text}.')
